04_Simulation/pehill/case_1p2_test/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<vector> 
14751
(
(9.72225 3.034 0.05)
(9.62355 3.034 0.05)
(9.52484 3.034 0.05)
(9.42614 3.034 0.05)
(9.32744 3.034 0.05)
(9.22873 3.034 0.05)
(9.13003 3.034 0.05)
(9.03133 3.034 0.05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(0.0493515 1 0.05)
(0.148055 0.998855 0.05)
(0.246758 0.992109 0.05)
(0.345461 0.973846 0.05)
(0.444164 0.939844 0.05)
(0.542867 0.890262 0.05)
(0.64157 0.829336 0.05)
(0.740273 0.761714 0.05)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(9.72225 3.036 0.05)
(9.62355 3.036 0.05)
(9.52484 3.036 0.05)
(9.42614 3.036 0.05)
(9.32744 3.036 0.05)
(9.22873 3.036 0.05)
(9.13003 3.036 0.05)
(9.03133 3.036 0.05)
...
)
;
    }
}


// ************************************************************************* //
