04_Simulation/pehill/case_1p2_test/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
14751
(
9.72225
9.62355
9.52484
9.42614
9.32744
9.22873
9.13003
9.03133
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0493515
0.148055
0.246758
0.345461
0.444164
0.542867
0.64157
0.740273
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
9.72225
9.62355
9.52484
9.42614
9.32744
9.22873
9.13003
9.03133
...
)
;
    }
}


// ************************************************************************* //
